MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAS169/mcu.h
#define _SRCON0B_SR0B6_POSITION                  0x00000006
#define _SRCON0B_SR0B6_MASK                      0x00000040
#define _SRCON0B_SR0B6_LENGTH                    0x00000001

#define _SRCON0B_SR0B7_POSITION                  0x00000007
#define _SRCON0B_SR0B7_MASK                      0x00000080
#define _SRCON0B_SR0B7_LENGTH                    0x00000001

#define _SRCON0B_SR0B8_POSITION                  0x00000008
#define _SRCON0B_SR0B8_MASK                      0x00000100
#define _SRCON0B_SR0B8_LENGTH                    0x00000001

#define _SRCON0B_SR0B9_POSITION                  0x00000009
#define _SRCON0B_SR0B9_MASK                      0x00000200
#define _SRCON0B_SR0B9_LENGTH                    0x00000001

#define _SRCON0B_SR0B10_POSITION                 0x0000000A
#define _SRCON0B_SR0B10_MASK                     0x00000400
#define _SRCON0B_SR0B10_LENGTH                   0x00000001

#define _SRCON0B_SR0B11_POSITION                 0x0000000B
#define _SRCON0B_SR0B11_MASK                     0x00000800
#define _SRCON0B_SR0B11_LENGTH                   0x00000001

#define _SRCON0B_SR0B12_POSITION                 0x0000000C
#define _SRCON0B_SR0B12_MASK                     0x00001000
#define _SRCON0B_SR0B12_LENGTH                   0x00000001

#define _SRCON0B_SR0B13_POSITION                 0x0000000D
#define _SRCON0B_SR0B13_MASK                     0x00002000
#define _SRCON0B_SR0B13_LENGTH                   0x00000001

#define _SRCON0B_SR0B14_POSITION                 0x0000000E
#define _SRCON0B_SR0B14_MASK                     0x00004000
#define _SRCON0B_SR0B14_LENGTH                   0x00000001

#define _SRCON0B_SR0B15_POSITION                 0x0000000F
#define _SRCON0B_SR0B15_MASK                     0x00008000
#define _SRCON0B_SR0B15_LENGTH                   0x00000001

#define _SRCON1B_SR1B0_POSITION                  0x00000000
#define _SRCON1B_SR1B0_MASK                      0x00000001
#define _SRCON1B_SR1B0_LENGTH                    0x00000001

#define _SRCON1B_SR1B1_POSITION                  0x00000001
#define _SRCON1B_SR1B1_MASK                      0x00000002
#define _SRCON1B_SR1B1_LENGTH                    0x00000001

#define _SRCON1B_SR1B2_POSITION                  0x00000002
#define _SRCON1B_SR1B2_MASK                      0x00000004
#define _SRCON1B_SR1B2_LENGTH                    0x00000001

#define _SRCON1B_SR1B3_POSITION                  0x00000003
#define _SRCON1B_SR1B3_MASK                      0x00000008
#define _SRCON1B_SR1B3_LENGTH                    0x00000001

#define _SRCON1B_SR1B4_POSITION                  0x00000004
#define _SRCON1B_SR1B4_MASK                      0x00000010
#define _SRCON1B_SR1B4_LENGTH                    0x00000001

#define _SRCON1B_SR1B5_POSITION                  0x00000005
#define _SRCON1B_SR1B5_MASK                      0x00000020
#define _SRCON1B_SR1B5_LENGTH                    0x00000001

#define _SRCON1B_SR1B6_POSITION                  0x00000006
#define _SRCON1B_SR1B6_MASK                      0x00000040
#define _SRCON1B_SR1B6_LENGTH                    0x00000001

#define _SRCON1B_SR1B7_POSITION                  0x00000007
#define _SRCON1B_SR1B7_MASK                      0x00000080
#define _SRCON1B_SR1B7_LENGTH                    0x00000001

#define _SRCON1B_SR1B8_POSITION                  0x00000008
#define _SRCON1B_SR1B8_MASK                      0x00000100
#define _SRCON1B_SR1B8_LENGTH                    0x00000001

#define _SRCON1B_SR1B9_POSITION                  0x00000009
#define _SRCON1B_SR1B9_MASK                      0x00000200
#define _SRCON1B_SR1B9_LENGTH                    0x00000001

#define _SRCON1B_SR1B10_POSITION                 0x0000000A
#define _SRCON1B_SR1B10_MASK                     0x00000400
#define _SRCON1B_SR1B10_LENGTH                   0x00000001

#define _SRCON1B_SR1B11_POSITION                 0x0000000B
#define _SRCON1B_SR1B11_MASK                     0x00000800
#define _SRCON1B_SR1B11_LENGTH                   0x00000001

#define _SRCON1B_SR1B12_POSITION                 0x0000000C
#define _SRCON1B_SR1B12_MASK                     0x00001000
#define _SRCON1B_SR1B12_LENGTH                   0x00000001

#define _SRCON1B_SR1B13_POSITION                 0x0000000D
#define _SRCON1B_SR1B13_MASK                     0x00002000
#define _SRCON1B_SR1B13_LENGTH                   0x00000001

#define _SRCON1B_SR1B14_POSITION                 0x0000000E
#define _SRCON1B_SR1B14_MASK                     0x00004000
#define _SRCON1B_SR1B14_LENGTH                   0x00000001

#define _SRCON1B_SR1B15_POSITION                 0x0000000F
#define _SRCON1B_SR1B15_MASK                     0x00008000
#define _SRCON1B_SR1B15_LENGTH                   0x00000001

#define _ANSELC_ANSC1_POSITION                   0x00000001
#define _ANSELC_ANSC1_MASK                       0x00000002
#define _ANSELC_ANSC1_LENGTH                     0x00000001

#define _ANSELC_ANSC2_POSITION                   0x00000002
#define _ANSELC_ANSC2_MASK                       0x00000004
#define _ANSELC_ANSC2_LENGTH                     0x00000001

#define _ANSELC_ANSC3_POSITION                   0x00000003
#define _ANSELC_ANSC3_MASK                       0x00000008
#define _ANSELC_ANSC3_LENGTH                     0x00000001

#define _ANSELC_ANSC4_POSITION                   0x00000004
#define _ANSELC_ANSC4_MASK                       0x00000010
#define _ANSELC_ANSC4_LENGTH                     0x00000001

#define _ANSELC_w_POSITION                       0x00000000
#define _ANSELC_w_MASK                           0xFFFFFFFF
#define _ANSELC_w_LENGTH                         0x00000020

#define _TRISC_TRISC1_POSITION                   0x00000001
#define _TRISC_TRISC1_MASK                       0x00000002
#define _TRISC_TRISC1_LENGTH                     0x00000001

#define _TRISC_TRISC2_POSITION                   0x00000002
#define _TRISC_TRISC2_MASK                       0x00000004
#define _TRISC_TRISC2_LENGTH                     0x00000001

#define _TRISC_TRISC3_POSITION                   0x00000003
#define _TRISC_TRISC3_MASK                       0x00000008
#define _TRISC_TRISC3_LENGTH                     0x00000001

