MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAS169/mcu.h
#define _CNCONH_EDGEDETECT_POSITION              0x0000000B
#define _CNCONH_EDGEDETECT_MASK                  0x00000800
#define _CNCONH_EDGEDETECT_LENGTH                0x00000001

#define _CNCONH_ON_POSITION                      0x0000000F
#define _CNCONH_ON_MASK                          0x00008000
#define _CNCONH_ON_LENGTH                        0x00000001

#define _CNCONH_w_POSITION                       0x00000000
#define _CNCONH_w_MASK                           0xFFFFFFFF
#define _CNCONH_w_LENGTH                         0x00000020

#define _CNENH_CNIEH0_POSITION                   0x00000000
#define _CNENH_CNIEH0_MASK                       0x00000001
#define _CNENH_CNIEH0_LENGTH                     0x00000001

#define _CNENH_CNIEH1_POSITION                   0x00000001
#define _CNENH_CNIEH1_MASK                       0x00000002
#define _CNENH_CNIEH1_LENGTH                     0x00000001

#define _CNENH_CNIEH2_POSITION                   0x00000002
#define _CNENH_CNIEH2_MASK                       0x00000004
#define _CNENH_CNIEH2_LENGTH                     0x00000001

#define _CNENH_CNIEH3_POSITION                   0x00000003
#define _CNENH_CNIEH3_MASK                       0x00000008
#define _CNENH_CNIEH3_LENGTH                     0x00000001

#define _CNENH_CNIEH4_POSITION                   0x00000004
#define _CNENH_CNIEH4_MASK                       0x00000010
#define _CNENH_CNIEH4_LENGTH                     0x00000001

#define _CNENH_CNIEH5_POSITION                   0x00000005
#define _CNENH_CNIEH5_MASK                       0x00000020
#define _CNENH_CNIEH5_LENGTH                     0x00000001

#define _CNENH_CNIEH6_POSITION                   0x00000006
#define _CNENH_CNIEH6_MASK                       0x00000040
#define _CNENH_CNIEH6_LENGTH                     0x00000001

#define _CNENH_CNIEH7_POSITION                   0x00000007
#define _CNENH_CNIEH7_MASK                       0x00000080
#define _CNENH_CNIEH7_LENGTH                     0x00000001

#define _CNENH_CNIEH8_POSITION                   0x00000008
#define _CNENH_CNIEH8_MASK                       0x00000100
#define _CNENH_CNIEH8_LENGTH                     0x00000001

#define _CNENH_CNIEH9_POSITION                   0x00000009
#define _CNENH_CNIEH9_MASK                       0x00000200
#define _CNENH_CNIEH9_LENGTH                     0x00000001

#define _CNENH_CNIEH10_POSITION                  0x0000000A
#define _CNENH_CNIEH10_MASK                      0x00000400
#define _CNENH_CNIEH10_LENGTH                    0x00000001

#define _CNENH_CNIEH11_POSITION                  0x0000000B
#define _CNENH_CNIEH11_MASK                      0x00000800
#define _CNENH_CNIEH11_LENGTH                    0x00000001

#define _CNENH_CNIEH12_POSITION                  0x0000000C
#define _CNENH_CNIEH12_MASK                      0x00001000
#define _CNENH_CNIEH12_LENGTH                    0x00000001

#define _CNENH_CNIEH13_POSITION                  0x0000000D
#define _CNENH_CNIEH13_MASK                      0x00002000
#define _CNENH_CNIEH13_LENGTH                    0x00000001

#define _CNENH_CNIEH14_POSITION                  0x0000000E
#define _CNENH_CNIEH14_MASK                      0x00004000
#define _CNENH_CNIEH14_LENGTH                    0x00000001

#define _CNENH_CNIEH15_POSITION                  0x0000000F
#define _CNENH_CNIEH15_MASK                      0x00008000
#define _CNENH_CNIEH15_LENGTH                    0x00000001

#define _CNENH_w_POSITION                        0x00000000
#define _CNENH_w_MASK                            0xFFFFFFFF
#define _CNENH_w_LENGTH                          0x00000020

#define _CNSTATH_CNSTATH0_POSITION               0x00000000
#define _CNSTATH_CNSTATH0_MASK                   0x00000001
#define _CNSTATH_CNSTATH0_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH1_POSITION               0x00000001
#define _CNSTATH_CNSTATH1_MASK                   0x00000002
#define _CNSTATH_CNSTATH1_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH2_POSITION               0x00000002
#define _CNSTATH_CNSTATH2_MASK                   0x00000004
#define _CNSTATH_CNSTATH2_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH3_POSITION               0x00000003
#define _CNSTATH_CNSTATH3_MASK                   0x00000008
#define _CNSTATH_CNSTATH3_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH4_POSITION               0x00000004
#define _CNSTATH_CNSTATH4_MASK                   0x00000010
#define _CNSTATH_CNSTATH4_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH5_POSITION               0x00000005
#define _CNSTATH_CNSTATH5_MASK                   0x00000020
#define _CNSTATH_CNSTATH5_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH6_POSITION               0x00000006
#define _CNSTATH_CNSTATH6_MASK                   0x00000040
#define _CNSTATH_CNSTATH6_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH7_POSITION               0x00000007
#define _CNSTATH_CNSTATH7_MASK                   0x00000080
#define _CNSTATH_CNSTATH7_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH8_POSITION               0x00000008
#define _CNSTATH_CNSTATH8_MASK                   0x00000100
#define _CNSTATH_CNSTATH8_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH9_POSITION               0x00000009
#define _CNSTATH_CNSTATH9_MASK                   0x00000200
#define _CNSTATH_CNSTATH9_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH10_POSITION              0x0000000A
#define _CNSTATH_CNSTATH10_MASK                  0x00000400
#define _CNSTATH_CNSTATH10_LENGTH                0x00000001

#define _CNSTATH_CNSTATH11_POSITION              0x0000000B
#define _CNSTATH_CNSTATH11_MASK                  0x00000800
#define _CNSTATH_CNSTATH11_LENGTH                0x00000001

#define _CNSTATH_CNSTATH12_POSITION              0x0000000C
#define _CNSTATH_CNSTATH12_MASK                  0x00001000
#define _CNSTATH_CNSTATH12_LENGTH                0x00000001

#define _CNSTATH_CNSTATH13_POSITION              0x0000000D
#define _CNSTATH_CNSTATH13_MASK                  0x00002000
#define _CNSTATH_CNSTATH13_LENGTH                0x00000001

#define _CNSTATH_CNSTATH14_POSITION              0x0000000E
#define _CNSTATH_CNSTATH14_MASK                  0x00004000
#define _CNSTATH_CNSTATH14_LENGTH                0x00000001

#define _CNSTATH_CNSTATH15_POSITION              0x0000000F
#define _CNSTATH_CNSTATH15_MASK                  0x00008000
#define _CNSTATH_CNSTATH15_LENGTH                0x00000001

#define _CNSTATH_w_POSITION                      0x00000000
#define _CNSTATH_w_MASK                          0xFFFFFFFF
#define _CNSTATH_w_LENGTH                        0x00000020

#define _CNNEH_CNNEH0_POSITION                   0x00000000
#define _CNNEH_CNNEH0_MASK                       0x00000001
#define _CNNEH_CNNEH0_LENGTH                     0x00000001

#define _CNNEH_CNNEH1_POSITION                   0x00000001
#define _CNNEH_CNNEH1_MASK                       0x00000002
#define _CNNEH_CNNEH1_LENGTH                     0x00000001

