MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAS169/mcu.h
#define _DDRPHYPADCON_RCVREN_POSITION            0x0000001C
#define _DDRPHYPADCON_RCVREN_MASK                0x10000000
#define _DDRPHYPADCON_RCVREN_LENGTH              0x00000001

#define _DDRPHYPADCON_PREAMBDLY_POSITION         0x0000001D
#define _DDRPHYPADCON_PREAMBDLY_MASK             0x60000000
#define _DDRPHYPADCON_PREAMBDLY_LENGTH           0x00000002

#define _DDRPHYDLLR_RECALIBCNT_POSITION          0x00000008
#define _DDRPHYDLLR_RECALIBCNT_MASK              0x03FFFF00
#define _DDRPHYDLLR_RECALIBCNT_LENGTH            0x00000012

#define _DDRPHYDLLR_DISRECALIB_POSITION          0x0000001A
#define _DDRPHYDLLR_DISRECALIB_MASK              0x04000000
#define _DDRPHYDLLR_DISRECALIB_LENGTH            0x00000001

#define _DDRPHYDLLR_DLYSTVAL_POSITION            0x0000001C
#define _DDRPHYDLLR_DLYSTVAL_MASK                0xF0000000
#define _DDRPHYDLLR_DLYSTVAL_LENGTH              0x00000004

#define _DDRPHYDLLCTRL_DDRDLLTRIM_POSITION       0x00000000
#define _DDRPHYDLLCTRL_DDRDLLTRIM_MASK           0x000000FF
#define _DDRPHYDLLCTRL_DDRDLLTRIM_LENGTH         0x00000008

#define _DDRPHYCLKDLY_CLKDLYDELTA_POSITION       0x00000000
#define _DDRPHYCLKDLY_CLKDLYDELTA_MASK           0x00000007
#define _DDRPHYCLKDLY_CLKDLYDELTA_LENGTH         0x00000003

#define _DDRPHYCLKDLY_SCLLBPASS_POSITION         0x00000004
#define _DDRPHYCLKDLY_SCLLBPASS_MASK             0x00000010
#define _DDRPHYCLKDLY_SCLLBPASS_LENGTH           0x00000001

#define _DDRPHYCLKDLY_SCLUBPASS_POSITION         0x00000005
#define _DDRPHYCLKDLY_SCLUBPASS_MASK             0x00000020
#define _DDRPHYCLKDLY_SCLUBPASS_LENGTH           0x00000001

#define _DDRADLLBYP_ANLDLLBYP_POSITION           0x00000018
#define _DDRADLLBYP_ANLDLLBYP_MASK               0x01000000
#define _DDRADLLBYP_ANLDLLBYP_LENGTH             0x00000001

#define _DDRSCLCFG2_SCLLANSEL_POSITION           0x00000000
#define _DDRSCLCFG2_SCLLANSEL_MASK               0x00000003
#define _DDRSCLCFG2_SCLLANSEL_LENGTH             0x00000002

#define _DDRPHYSCLADR_SCLROWADR_POSITION         0x00000000
#define _DDRPHYSCLADR_SCLROWADR_MASK             0x0000FFFF
#define _DDRPHYSCLADR_SCLROWADR_LENGTH           0x00000010

#define _DDRPHYSCLADR_SCLCOLADR_POSITION         0x00000010
#define _DDRPHYSCLADR_SCLCOLADR_MASK             0x1FFF0000
#define _DDRPHYSCLADR_SCLCOLADR_LENGTH           0x0000000D

#define _DDRPHYSCLADR_SCLBANKADR_POSITION        0x0000001D
#define _DDRPHYSCLADR_SCLBANKADR_MASK            0xE0000000
#define _DDRPHYSCLADR_SCLBANKADR_LENGTH          0x00000003

#define _GLCDMODE_RGBSEQ_POSITION                0x00000005
#define _GLCDMODE_RGBSEQ_MASK                    0x000000E0
#define _GLCDMODE_RGBSEQ_LENGTH                  0x00000003

#define _GLCDMODE_FORMATCLK_POSITION             0x00000008
#define _GLCDMODE_FORMATCLK_MASK                 0x00000100
#define _GLCDMODE_FORMATCLK_LENGTH               0x00000001

#define _GLCDMODE_YUVOUTPUT_POSITION             0x00000009
#define _GLCDMODE_YUVOUTPUT_MASK                 0x00000200
#define _GLCDMODE_YUVOUTPUT_LENGTH               0x00000001

#define _GLCDMODE_FORCEBLANK_POSITION            0x00000013
#define _GLCDMODE_FORCEBLANK_MASK                0x00080000
#define _GLCDMODE_FORCEBLANK_LENGTH              0x00000001

#define _GLCDMODE_PGRAMPEN_POSITION              0x00000014
#define _GLCDMODE_PGRAMPEN_MASK                  0x00100000
#define _GLCDMODE_PGRAMPEN_LENGTH                0x00000001

#define _GLCDMODE_PCLKPOL_POSITION               0x00000016
#define _GLCDMODE_PCLKPOL_MASK                   0x00400000
#define _GLCDMODE_PCLKPOL_LENGTH                 0x00000001

#define _GLCDMODE_VSYNCCYC_POSITION              0x00000017
#define _GLCDMODE_VSYNCCYC_MASK                  0x00800000
#define _GLCDMODE_VSYNCCYC_LENGTH                0x00000001

#define _GLCDMODE_DITHER_POSITION                0x00000018
#define _GLCDMODE_DITHER_MASK                    0x01000000
#define _GLCDMODE_DITHER_LENGTH                  0x00000001

#define _GLCDMODE_DEPOL_POSITION                 0x0000001A
#define _GLCDMODE_DEPOL_MASK                     0x04000000
#define _GLCDMODE_DEPOL_LENGTH                   0x00000001

#define _GLCDMODE_HSYNCPOL_POSITION              0x0000001B
#define _GLCDMODE_HSYNCPOL_MASK                  0x08000000
#define _GLCDMODE_HSYNCPOL_LENGTH                0x00000001

#define _GLCDMODE_VSYNCPOL_POSITION              0x0000001C
#define _GLCDMODE_VSYNCPOL_MASK                  0x10000000
#define _GLCDMODE_VSYNCPOL_LENGTH                0x00000001

#define _GLCDMODE_CURSOREN_POSITION              0x0000001E
#define _GLCDMODE_CURSOREN_MASK                  0x40000000
#define _GLCDMODE_CURSOREN_LENGTH                0x00000001

#define _GLCDMODE_LCDEN_POSITION                 0x0000001F
#define _GLCDMODE_LCDEN_MASK                     0x80000000
#define _GLCDMODE_LCDEN_LENGTH                   0x00000001

#define _GLCDCLKCON_CLKDIV_POSITION              0x00000000
#define _GLCDCLKCON_CLKDIV_MASK                  0x0000003F
#define _GLCDCLKCON_CLKDIV_LENGTH                0x00000006

#define _GLCDCLKCON_LPREFETCH_POSITION           0x00000008
#define _GLCDCLKCON_LPREFETCH_MASK               0x00003F00
#define _GLCDCLKCON_LPREFETCH_LENGTH             0x00000006

#define _GLCDBGCOLOR_ALPHA_POSITION              0x00000000
#define _GLCDBGCOLOR_ALPHA_MASK                  0x000000FF
#define _GLCDBGCOLOR_ALPHA_LENGTH                0x00000008

#define _GLCDBGCOLOR_BLUE_POSITION               0x00000008
#define _GLCDBGCOLOR_BLUE_MASK                   0x0000FF00
#define _GLCDBGCOLOR_BLUE_LENGTH                 0x00000008

#define _GLCDBGCOLOR_GREEN_POSITION              0x00000010
#define _GLCDBGCOLOR_GREEN_MASK                  0x00FF0000
#define _GLCDBGCOLOR_GREEN_LENGTH                0x00000008

#define _GLCDBGCOLOR_RED_POSITION                0x00000018
#define _GLCDBGCOLOR_RED_MASK                    0xFF000000
#define _GLCDBGCOLOR_RED_LENGTH                  0x00000008

#define _GLCDRES_RESY_POSITION                   0x00000000
#define _GLCDRES_RESY_MASK                       0x000007FF
#define _GLCDRES_RESY_LENGTH                     0x0000000B

#define _GLCDRES_RESX_POSITION                   0x00000010
#define _GLCDRES_RESX_MASK                       0x07FF0000
#define _GLCDRES_RESX_LENGTH                     0x0000000B

#define _GLCDFPORCH_FPORCHY_POSITION             0x00000000
#define _GLCDFPORCH_FPORCHY_MASK                 0x000007FF
#define _GLCDFPORCH_FPORCHY_LENGTH               0x0000000B

#define _GLCDFPORCH_FPORCHX_POSITION             0x00000010
#define _GLCDFPORCH_FPORCHX_MASK                 0x07FF0000
#define _GLCDFPORCH_FPORCHX_LENGTH               0x0000000B

#define _GLCDBLANKING_BLANKINGY_POSITION         0x00000000
#define _GLCDBLANKING_BLANKINGY_MASK             0x000007FF
#define _GLCDBLANKING_BLANKINGY_LENGTH           0x0000000B

#define _GLCDBLANKING_BLANKINGX_POSITION         0x00000010
#define _GLCDBLANKING_BLANKINGX_MASK             0x07FF0000
#define _GLCDBLANKING_BLANKINGX_LENGTH           0x0000000B

#define _GLCDBPORCH_BPORCHY_POSITION             0x00000000
#define _GLCDBPORCH_BPORCHY_MASK                 0x000007FF
#define _GLCDBPORCH_BPORCHY_LENGTH               0x0000000B

#define _GLCDBPORCH_BPORCHX_POSITION             0x00000010
#define _GLCDBPORCH_BPORCHX_MASK                 0x07FF0000
#define _GLCDBPORCH_BPORCHX_LENGTH               0x0000000B

