MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAS169/mcu.h
#define _GLCDCURDATA54_PIXEL1323_POSITION        0x00000000
#define _GLCDCURDATA54_PIXEL1323_MASK            0x0000000F
#define _GLCDCURDATA54_PIXEL1323_LENGTH          0x00000004

#define _GLCDCURDATA54_PIXEL1322_POSITION        0x00000004
#define _GLCDCURDATA54_PIXEL1322_MASK            0x000000F0
#define _GLCDCURDATA54_PIXEL1322_LENGTH          0x00000004

#define _GLCDCURDATA54_PIXEL1321_POSITION        0x00000008
#define _GLCDCURDATA54_PIXEL1321_MASK            0x00000F00
#define _GLCDCURDATA54_PIXEL1321_LENGTH          0x00000004

#define _GLCDCURDATA54_PIXEL1320_POSITION        0x0000000C
#define _GLCDCURDATA54_PIXEL1320_MASK            0x0000F000
#define _GLCDCURDATA54_PIXEL1320_LENGTH          0x00000004

#define _GLCDCURDATA54_PIXEL1319_POSITION        0x00000010
#define _GLCDCURDATA54_PIXEL1319_MASK            0x000F0000
#define _GLCDCURDATA54_PIXEL1319_LENGTH          0x00000004

#define _GLCDCURDATA54_PIXEL1318_POSITION        0x00000014
#define _GLCDCURDATA54_PIXEL1318_MASK            0x00F00000
#define _GLCDCURDATA54_PIXEL1318_LENGTH          0x00000004

#define _GLCDCURDATA54_PIXEL1317_POSITION        0x00000018
#define _GLCDCURDATA54_PIXEL1317_MASK            0x0F000000
#define _GLCDCURDATA54_PIXEL1317_LENGTH          0x00000004

#define _GLCDCURDATA54_PIXEL1316_POSITION        0x0000001C
#define _GLCDCURDATA54_PIXEL1316_MASK            0xF0000000
#define _GLCDCURDATA54_PIXEL1316_LENGTH          0x00000004

#define _GLCDCURDATA55_PIXEL1331_POSITION        0x00000000
#define _GLCDCURDATA55_PIXEL1331_MASK            0x0000000F
#define _GLCDCURDATA55_PIXEL1331_LENGTH          0x00000004

#define _GLCDCURDATA55_PIXEL1330_POSITION        0x00000004
#define _GLCDCURDATA55_PIXEL1330_MASK            0x000000F0
#define _GLCDCURDATA55_PIXEL1330_LENGTH          0x00000004

#define _GLCDCURDATA55_PIXEL1329_POSITION        0x00000008
#define _GLCDCURDATA55_PIXEL1329_MASK            0x00000F00
#define _GLCDCURDATA55_PIXEL1329_LENGTH          0x00000004

#define _GLCDCURDATA55_PIXEL1328_POSITION        0x0000000C
#define _GLCDCURDATA55_PIXEL1328_MASK            0x0000F000
#define _GLCDCURDATA55_PIXEL1328_LENGTH          0x00000004

#define _GLCDCURDATA55_PIXEL1327_POSITION        0x00000010
#define _GLCDCURDATA55_PIXEL1327_MASK            0x000F0000
#define _GLCDCURDATA55_PIXEL1327_LENGTH          0x00000004

#define _GLCDCURDATA55_PIXEL1326_POSITION        0x00000014
#define _GLCDCURDATA55_PIXEL1326_MASK            0x00F00000
#define _GLCDCURDATA55_PIXEL1326_LENGTH          0x00000004

#define _GLCDCURDATA55_PIXEL1325_POSITION        0x00000018
#define _GLCDCURDATA55_PIXEL1325_MASK            0x0F000000
#define _GLCDCURDATA55_PIXEL1325_LENGTH          0x00000004

#define _GLCDCURDATA55_PIXEL1324_POSITION        0x0000001C
#define _GLCDCURDATA55_PIXEL1324_MASK            0xF0000000
#define _GLCDCURDATA55_PIXEL1324_LENGTH          0x00000004

#define _GLCDCURDATA56_PIXEL147_POSITION         0x00000000
#define _GLCDCURDATA56_PIXEL147_MASK             0x0000000F
#define _GLCDCURDATA56_PIXEL147_LENGTH           0x00000004

#define _GLCDCURDATA56_PIXEL146_POSITION         0x00000004
#define _GLCDCURDATA56_PIXEL146_MASK             0x000000F0
#define _GLCDCURDATA56_PIXEL146_LENGTH           0x00000004

#define _GLCDCURDATA56_PIXEL145_POSITION         0x00000008
#define _GLCDCURDATA56_PIXEL145_MASK             0x00000F00
#define _GLCDCURDATA56_PIXEL145_LENGTH           0x00000004

#define _GLCDCURDATA56_PIXEL144_POSITION         0x0000000C
#define _GLCDCURDATA56_PIXEL144_MASK             0x0000F000
#define _GLCDCURDATA56_PIXEL144_LENGTH           0x00000004

#define _GLCDCURDATA56_PIXEL143_POSITION         0x00000010
#define _GLCDCURDATA56_PIXEL143_MASK             0x000F0000
#define _GLCDCURDATA56_PIXEL143_LENGTH           0x00000004

#define _GLCDCURDATA56_PIXEL142_POSITION         0x00000014
#define _GLCDCURDATA56_PIXEL142_MASK             0x00F00000
#define _GLCDCURDATA56_PIXEL142_LENGTH           0x00000004

#define _GLCDCURDATA56_PIXEL141_POSITION         0x00000018
#define _GLCDCURDATA56_PIXEL141_MASK             0x0F000000
#define _GLCDCURDATA56_PIXEL141_LENGTH           0x00000004

#define _GLCDCURDATA56_PIXEL140_POSITION         0x0000001C
#define _GLCDCURDATA56_PIXEL140_MASK             0xF0000000
#define _GLCDCURDATA56_PIXEL140_LENGTH           0x00000004

#define _GLCDCURDATA57_PIXEL1415_POSITION        0x00000000
#define _GLCDCURDATA57_PIXEL1415_MASK            0x0000000F
#define _GLCDCURDATA57_PIXEL1415_LENGTH          0x00000004

#define _GLCDCURDATA57_PIXEL1414_POSITION        0x00000004
#define _GLCDCURDATA57_PIXEL1414_MASK            0x000000F0
#define _GLCDCURDATA57_PIXEL1414_LENGTH          0x00000004

#define _GLCDCURDATA57_PIXEL1413_POSITION        0x00000008
#define _GLCDCURDATA57_PIXEL1413_MASK            0x00000F00
#define _GLCDCURDATA57_PIXEL1413_LENGTH          0x00000004

#define _GLCDCURDATA57_PIXEL1412_POSITION        0x0000000C
#define _GLCDCURDATA57_PIXEL1412_MASK            0x0000F000
#define _GLCDCURDATA57_PIXEL1412_LENGTH          0x00000004

#define _GLCDCURDATA57_PIXEL1411_POSITION        0x00000010
#define _GLCDCURDATA57_PIXEL1411_MASK            0x000F0000
#define _GLCDCURDATA57_PIXEL1411_LENGTH          0x00000004

#define _GLCDCURDATA57_PIXEL1410_POSITION        0x00000014
#define _GLCDCURDATA57_PIXEL1410_MASK            0x00F00000
#define _GLCDCURDATA57_PIXEL1410_LENGTH          0x00000004

#define _GLCDCURDATA57_PIXEL149_POSITION         0x00000018
#define _GLCDCURDATA57_PIXEL149_MASK             0x0F000000
#define _GLCDCURDATA57_PIXEL149_LENGTH           0x00000004

#define _GLCDCURDATA57_PIXEL148_POSITION         0x0000001C
#define _GLCDCURDATA57_PIXEL148_MASK             0xF0000000
#define _GLCDCURDATA57_PIXEL148_LENGTH           0x00000004

#define _GLCDCURDATA58_PIXEL1423_POSITION        0x00000000
#define _GLCDCURDATA58_PIXEL1423_MASK            0x0000000F
#define _GLCDCURDATA58_PIXEL1423_LENGTH          0x00000004

#define _GLCDCURDATA58_PIXEL1422_POSITION        0x00000004
#define _GLCDCURDATA58_PIXEL1422_MASK            0x000000F0
#define _GLCDCURDATA58_PIXEL1422_LENGTH          0x00000004

#define _GLCDCURDATA58_PIXEL1421_POSITION        0x00000008
#define _GLCDCURDATA58_PIXEL1421_MASK            0x00000F00
#define _GLCDCURDATA58_PIXEL1421_LENGTH          0x00000004

